===
multiline parameters
===
f[
 x
 ]
---

(program
  (progn
    (func_app
      (variable
        (identifier))
      (parameter_pass
        (newline_extra)
        (variable
          (identifier))
        (newline_extra)))))

===
many multiline parameters
===
f[
 x;
 y;
 1+1
 ]
---

(program
  (progn
    (func_app
      (variable
        (identifier))
      (parameter_pass
        (newline_extra)
        (variable
          (identifier))
        (semicolon)
        (newline_extra)
        (variable
          (identifier))
        (semicolon)
        (newline_extra)
        (func_app
          (number)
          (builtin_infix_func)
          (number))
        (newline_extra)))))

===
ambiguous multiline
===
1 +
      1
---

(program
  (progn
    (func_app
      (number)
      (builtin_infix_func)
      (newline_extra)
      (number))))

===
multiline through comments
===
1 +
/ a
/
a
\
 22
---

(program
  (progn
    (func_app
      (number)
      (builtin_infix_func)
      (comment)
      (comment_block)
      (newline_extra)
      (number))))

===
multline var
===
1+
    .a

---

(program
  (progn
    (func_app
      (number)
      (builtin_infix_func)
      (newline_extra)
      (variable
        (namespace)))))
