===
variable name
===
table
---

(program
  (progn
    (variable
      (identifier))))

===
underscores
===
big_table
---

(program
  (progn
    (variable
      (identifier))))

===
namespaces
===
.plotly
---

(program
  (progn
    (variable
      (namespace))))

===
namespaces inside namespaces
===
.plotly.plot_hist
---

(program
  (progn
    (variable
      (namespace)
      (identifier))))

===
numbers
===
t2
---

(program
  (progn
    (variable
      (identifier))))

===
global dictionary application
===
a.b
---

(program
  (progn
    (variable
      (identifier)
      (identifier))))

===
starting with space
===
   .a
---

(program
  (progn
    (variable
      (namespace))))

===
deeply nested variable
===
a.b.c.e.d.f.g
---

(program
  (progn
    (variable
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier))))

===
invalid atom vs identifier
===
.adv.sr.223.asdf.feadg.edd
---

(program
  (progn
    (variable
      (namespace)
      (identifier)
      (identifier)
      (identifier)
      (identifier)
      (identifier))))

===
where as a variable
===
x where x > 1
---

(program
  (progn
    (func_app
      (variable
        (identifier))
      (func_app
        (variable
          (identifier))
        (func_app
          (variable
            (identifier))
          (builtin_infix_func)
          (number))))))

===
from as a variable
===
12 * from
---

(program
  (progn
    (func_app
      (number)
      (builtin_infix_func)
      (variable
        (identifier)))))

===
by as a variable
===
1 + by
---

(program
  (progn
    (func_app
      (number)
      (builtin_infix_func)
      (variable
        (identifier)))))
